title: Suspicious Command Shell Spawned By WindowsUpdateHelper

id: 7f8e1f9d-a123-4c4d-9a8e-111111111111

status: experimental

description: Detects cmd.exe launched by WindowsUpdateHelper.exe

author: Xumoyun Maxmudov

date: 2026-06-18

logsource:
  product: windows
  category: process_creation

detection:

  selection_parent:
    ParentImage|endswith:
      '\WindowsUpdateHelper.exe'

  selection_child:
    Image|endswith:
      '\cmd.exe'

  condition: selection_parent and selection_child

falsepositives:
  - Unknown

level: high

tags:
  - attack.execution
  - attack.t1059.003
